#14.Напишите функцию Python, чтобы проверить, является ли строка панграммой или нет.  
a = input()
b = ['а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я']

def pangram(a):
    a = a.lower().replace(' ', '')
    a = a.replace('', ',')
    c = set(b) - set(a)
    if len(c) > 0:
        print("нет")
    else: print("да")
pangram(a)